from db import db


def check(user: int, day: str):
    try:
        return (eval("%s" % db.check_group(user) + "['%s']" % day))
    except:
        return ('Сталася помилка')


month = """
Парні(Низ)⠀ ⠀Непарні(Верх)
13.01 - 19.01⠀⠀⠀20.01 - 26.01
27.01 - 02.02⠀⠀⠀23.02 - 09.02
10.02 - 16.02⠀⠀⠀17.02 - 23.02
24.02 - 01.03⠀⠀⠀02.03 - 08.03
09.03 - 15.03⠀⠀⠀16.03 - 22.03
23.03 - 29.03⠀⠀⠀30.03 - 05.04
06.04 - 12.04⠀⠀⠀13.04 - 19.04
20.04 - 26.04⠀⠀⠀27.04 - 03.05
04.05 - 10.05⠀⠀⠀11.05 - 17.05
18.05 - 24.05⠀⠀⠀25.05 - 31.05
01.06 - 07.06⠀⠀⠀08.06 - 14.06
15.06 - 21.06⠀⠀⠀22.06 - 28.06

Актуально до  28.06.2020
"""


lesson_time_1 = '''
<b>Пара  Початок - кінець</b>
    1               08:30 - 10:05
    2               10:15 - 11:50
    3               12:20 - 13:55
    4               14:05 - 15:40
'''

break_time_1 = '''
<b>П'ятихвилинні перерви: </b>
             09:15 - 09:20
             11:00 - 11:05
             13:05 - 13:10
             14:50 - 14:55
'''

lesson_time_2 = '''
<b>Пара  Початок - кінець</b>
    1               12:45 - 14:20
    2               14:30 - 16:05
    3               16:15 - 17:50
    4               18:00 - 19:35
'''

break_time_2 = '''
<b>П'ятихвилинні перерви: </b>
             13:30 - 13:35
             15:15 - 15:20
             17:00 - 17:05
             18:45 - 18:50
'''


# OK timetables
ok_11 = {
    'mon': ('Понеділок\t               ОК-11'
            '\n 1) Математика'
            '\n 2) Українська література'
            '\n 3) Культурологія)'
            '\n 4) Фізична культура'
            ),
    'tue': ('Вівторок\t                  ОК-11'
            '\n 1)Математика'
            '\n 2)Іноземна мова '
            '\n 3) Зарубіжна література'
            ),
    'wed':('Середа\t                      ОК-11'
            '\n 1) -'
            '\n 2) Фізика і астрономія'
            '\n 3) Технології'
            '\n 4) Українська мова'
            ),
    'thu': ('Четвер\t                      ОК-11'
            '\n 1) Основи ЕТ'
            '\n 2) Технології'
            '\n 3) Біологія '
            '\n 4) Фізична культура / Фізика і астрономія'
            ),
    'fri': ("П'ятниця\t                  ОК-11"
            '\n 1)Технології '
            '\n 2)Інформатика '
            '\n 3)Всесвітня історія'
            )
}
ok_12 = {
    'mon': ('Понеділок\t               ОК-12'
            '\n 1) Культурологія'
            '\n 2) Математика'
            '\n 3) Українська література'
            '\n 4) Всесвітня історія'
            ),
    'tue': ('Вівторок\t                  ОК-12'
            '\n 1) Фізика і астрономія'
            '\n 2) Технології'
            '\n 3) Іноземна мова'
            '\n 4) Математика'
            ),
    'wed': ('Середа\t                      ОК-12'
            '\n 1) Фізична культура'
            '\n 2) Українська мова'
            '\n 3) Зарубіжна література'
            '\n 4) Технології'
            ),
    'thu': ('Четвер\t                      ОК-12'
            '\n 1) Біологія '
            '\n 2) Основи ЕТ'
            '\n 3) Технології'
            '\n 4) Фізика і астрономія / -'
            ),
    'fri': ("П'ятниця\t                  ОК-12"
            '\n 1) Інформатика '
            '\n 2) Фізична культура / -'
            )
}
ok_13 = {
    'mon': ('Понеділок\t               ОК-13'
            '\n 1) -'
            '\n 2) Культорологія (407)'
            '\n 3) Математика (407)'
            '\n 4) Технології (407)'
            ),
    'tue': ('Вівторок\t                  ОК-13'
            '\n 1) Іноземна мова (407)'
            '\n 2) Математика (407)'
            '\n 3) Технології (407)'
            '\n 4) Зарубіжна література (407)'
            ),
    'wed': ('Середа\t                      ОК-13'
            '\n 1) Технології (407)'
            '\n 2) Українська література (407)'
            '\n 3) Українська мова (407)'
            '\n 4) Фізика і Астрономія (407)'
            ),
    'thu': ('Четвер\t                      ОК-13'
            '\n 1) Фізкультура (КФВ))'
            '\n 2) Біологія (407)'
            '\n 3) Основи ЕТ (407)'
            '\n 4) Технології (407)'
            ),
    'fri': ("П'ятниця\t                  ОК-13"
            '\n 1) Фізкультура (КФВ) / Фізика і астрономія (407)'
            '\n 2) Всесвітня історія (407)'
            '\n 3) Інформатика (407)'
            )
}

ok_21 = {
    'mon': ('Понеділок\t               ОК-21'
            '\n 1)Фізика'
            '\n 2)Хімія'
            '\n 3)Захист Вітчизни'
            ),
    'tue': ('Вівторок\t                  ОК-21'
            '\n 1)Українська мова'   
            '\n 2)Алгоритми і МО'
            '\n 3)Захист Вітчизни/Основи правознавства'
            '\n 4)Фізика і астрономія'
            ),
    'wed': ('Середа\t                      ОК-21' 
            '\n 1)Фізика і астрономія'
            '\n 2)Фізична культура'
            '\n 3)Матем '
            '\n 4)Інформатика(шк)'
            ),
    'thu': ('Четвер\t                      ОК-21' 
            '\n 1)Іноземна мова'
            '\n 2)Історія України'
            '\n 3)Матем'
            '\n 4)Українська література'
            ),

    'fri': ("П'ятниця\t                  ОК-21"
            '\n 1)Хімія /Фізична культура'
            "\n 2)Географія"
            '\n 3)Фізика і астрономія'
            )
}
ok_22 = {
    'mon': ('Понеділок\t               ОК-22'
            '\n 1)Фізична культура'
            '\n 2) Фізика'
            '\n 3)Хімія'
            '\n 4)Захист Вітчизни'
            ),
    'tue': ('Вівторок\t                  ОК-22'
            '\n 1)Алгоритми і МО'
            '\n 2)Фізика і астрономія'
            '\n 3)Основи правознавства /Захист Вітчизни'
            '\n 4)Українська мова'
            ),
    'wed': ('Середа\t                      ОК-22'
            '\n 1)Інформатика(шк)'
            '\n 2)Матем'
            '\n 3)Історія України'
            '\n 4)Фізична культура/-'
            ),
    'thu': ('Четвер\t                      ОК-22'
            '\n 1)-'
            '\n 2)Фізика і астрономія'
            '\n 3)Українська література'
            '\n 4)Матем '
            '\n 5)Іноземна мова'
            ),
    'fri': ("П'ятниця\t                  ОК-22"
            '\n 1)-/Хімія '
            '\n 2)Фізика і астрономія'
            "\n 3)Географія"
            )
}


ok_31 = {
    'mon': ('Понеділок\t               ОК-31'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            '\n 5) '
            ),
    'tue': ('Вівторок\t                  ОК-31'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'wed':('Середа\t                      ОК-31'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'thu': ('Четвер\t                      ОК-31'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'fri': ('П\'ятниця\t                  ОК-31'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            )
}
ok_32 = {
    'mon': ('Понеділок\t               ОК-32'
            '\n 1) '
            '\n 2) Фізичне виховання'
            '\n 3) Дискретна математика'
            ),
    'tue': ('Вівторок\t                  ОК-32'
            '\n 1) Історія України'
            '\n 2) Периферійні пристрої'
            '\n 3) Програмування'
            "\n 4) Компютерна СТ"
            ),
    'wed':('Середа\t                      ОК-32'
            '\n 1) Компютерна ст'
            '\n 2) Безпека ЖД та ОП'
            '\n 3) Теорія Й та МС'
            "\n 4) Периферійні пристрої"
            ),
    'thu': ('Четвер\t                      ОК-32'
            '\n 1) Теорія Е та МК'
            '\n 2) Фізичне виховання'
            '\n 3) Іноземна мова'
            "\n 4) Програмування"
            ),
    'fri': ("П'ятниця\t                  ОК-32"
            '\n 1) Іноземна мова'
            '\n 2) Дискретна матем \ Периферійні пристрої'
            '\n 3) Теорія Е та МК'
            )
}

ok_41 = {
    'mon': ('Понеділок\t               ОК-41'
            '\n 1) '
            '\n 2) '
            '\n 3) Інженерна та КГ (404)'
            "\n 4) Мікроконтролери та їх П (404)"
            "\n 4) Комп'ютерні С та М (404)"
            ),
    'tue': ('Вівторок\t                  ОК-41'
            '\n 1) '
            '\n 2) '
            '\n 3) Комп\'ютерні С та М (404)'
            "\n 4) Мікроконтролери та їх П (404)"
            "\n 5) Архітектура комп'ютерів (404)"
            ),
    'wed':('Середа\t                      ОК-41'
            '\n 1) '
            '\n 2) '
            '\n 3) Архітектура комп\'ютерів (404)'
            "\n 4) Операційні системи (404)"
            "\n 5) Комп'ютерні С та М (404)"
            ),
    'thu': ('Четвер\t                      ОК-41'
            '\n 1) '
            '\n 2) - / Надійність, Д та ЕКСМ (404)'
            '\n 3) Українська мова за ПС (404)'
            "\n 4) МК та їх П / -"
            ),
    'fri': ("П'ятниця\t                  ОК-41"
            '\n 1) '
            '\n 2) Надійність, Д та ЕКСМ/Комп\'ютерні С та М '
            '\n 3) Фізичне виховання (кфв)'
            "\n 4) Мікроконтролери та їх П"
            )
}
ok_42 = {
    'mon': ('Понеділок\t               ОК-42'
            '\n 1) '
            '\n 2) '
            '\n 3) Інженерна та КГ'
            "\n 4) МК та їх П"
            "\n 5) Комп. С та М"
            ),
    'tue': ('Вівторок\t                  ОК-42'
            '\n 1) '
            '\n 2) '
            '\n 3) Комп. С та М'
            "\n 4) МК та їх П"
            "\n 5) Архітектура комп'ютерів"
            ),
    'wed': ('Середа\t                      ОК-42'
            '\n 1) '
            '\n 2) '
            '\n 3) Архітектура комп\'ютерів'
            "\n 4) Операційні системи"
            "\n 5) Комп. С та М"
            ),
    'thu': ('Четвер\t                      ОК-42'
            '\n 1) '
            '\n 2) '
            '\n 3) Н, Д та ЕКСМ'
            "\n 4) Укр. мова за ПС"
            "\n 5) МК та їх П / ОС"
            ),
    'fri': ("П'ятниця\t                  ОК-42"
            '\n 1) '
            '\n 2) Фізичне виховання'
            '\n 3) МК та їх П'
            "\n 4) Н, Д та ЕКСМ / Комп. С та М"
            )
}


# ZI timetables
zi_11 = {
    'mon': ('Понеділок\t               ЗІ-11'
            '\n 1) Інформатика'
            '\n 2) Всесвітня історія'
            '\n 3) Основи ЕТ'
            '\n 4) Культурологія'
            ),
    'tue': ('Вівторок\t                  ЗІ-11'
            '\n 1) Зарубіжна література'
            '\n 2) Біологія'
            '\n 3) Фізика і астрономія'
            '\n 4) Українська мова'
            ),
    'wed':('Середа\t                      ЗІ-11'
            '\n 1) -'
            '\n 2)Технології'
            '\n 3) Математика'
            '\n 4) -/Фізична культура'
            ),
    'thu': ('Четвер\t                      ЗІ-11'
            '\n 1) Математика'
            '\n 2) Фізична культура'
            '\n 3) Українська література'
            '\n 4) Іноземна мова'
            ),
    'fri': ("П'ятниця\t                  ЗІ-11"
            '\n 1) Технології'
            '\n 2) Технології'
            '\n 3) Фізика і астрономія/-'
            )
}
zi_12 = {
    'mon': ('Понеділок\t               ЗІ-12'
            '\n 1) Всесвітня історія'
            '\n 2) Інформатика'
            '\n 3) Біологія'
            '\n 4) Основи ЕТ'
            ),
    'tue': ('Вівторок\t                  ЗІ-12'
            '\n 1) Фізична культура'
            '\n 2) Зарубіжна література'
            '\n 3) Українська мова'
            '\n 4) Технології'
            ),
    'wed':('Середа\t                      ЗІ-12'
            '\n 1) Технології '
            '\n 2) Математика'
            '\n 3) Фізика і астрономія'
            ),
    'thu': ('Четвер\t                      ЗІ-12'
            '\n 1) Іноземна мова'
            '\n 2) Математика'
            '\n 3) Культорологія'
            '\n 4) Українська література'
            ),
    'fri': ("П'ятниця\t                  ЗІ-12"
            '\n 1) Фізика і астрономія / Фізична культура'
            '\n 2) Технології'
            )
}
zi_13 = {
    'mon': ('Понеділок\t               ЗІ-13'
            '\n 1) ФК(кфв)'
            '\n 2) Математика(406)'
            '\n 3) Фізика і астрономія(413)'
            '\n 4) Соціологія(226)'
            ),
    'tue': ('Вівторок\t                  ЗІ-13'
            '\n 1) -'
            '\n 2) Іноземна мова(302)'
            '\n 3) Біологія і екологія(401)'
            '\n 4) Фізика і астрономія(413)'
            ),
    'wed':('Середа\t                      ЗІ-13'
            '\n 1) Інформатика(405)'
            '\n 2) Історія України(211)'
            '\n 3) Математика(407)'
            '\n 4) Українська мова(230)'
            ),
    'thu': ('Четвер\t                      ЗІ-13'
            '\n 1) Фізична культура(кфв)'
            '\n 2) Українська література(230)'
            '\n 3) Інформатика(405)'
            '\n 4) Біологія і екологія(401)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-13"
            '\n 1) Всес. істор.(213) / Осн. пр-ва(213)'
            '\n 2) Зарубіжна література(214)'
            '\n 3) Хімія(401)'
            )
}

zi_110 = {
    'mon': ('Понеділок\t               ЗІ-110'
            '\n 1)Фізичне виховання'
            '\n 2)Теорія ЕК та С'
            '\n 3)Історія України'
            '\n 4)Фізика'
            ),
    'tue': ('Вівторок\t                  ЗІ-110'
            '\n 1)-'
            '\n 2)Вища математика'
            '\n 3)Інформатика'
            ),
    'wed':('Середа\t                      ЗІ-110'
            '\n 1)Іноземна мова(1)'
            '\n 2)Теорія ЕК та С'
            '\n 3)Інформатика '
            '\n 4) Фізика'
            ),
    'thu': ('Четвер\t                      ЗІ-110'
            '\n 1)Фізичне виховання'
            '\n 2)Вища математика'
            '\n 3)Основи екології '
            '\n 4)Культурологія'
            ),
    'fri': ("П'ятниця\t                  ЗІ-110"
            '\n 5)Іноземна мова(2)'
            '\n 1)-/Теорія ЕК та С'
            '\n 2)Теорія ЕК та С'
            )
}

zi_21 = {
    'mon': ('Понеділок\t               ЗІ-21'
            '\n 1) Георгафія'
            '\n 2) Фізика'
            '\n 3)Українська література'
            '\n 4) Хімія'
            ),
    'tue': ('Вівторок\t                  ЗІ-21'
            '\n 1) Інформатика (шк)'
            '\n 2) Захист Вітчизни /Основи правознавства'
            '\n 3) Математика'
            '\n 4) Фізика і астрономія'
            ),
    'wed':('Середа\t                      ЗІ-21'
            '\n 1) Математика'
            '\n 2) Фізика і астрономія'
            '\n 3) Фізична культура'
            '\n 4) Захист Вітчизни'
            ),
    'thu': ('Четвер\t                      ЗІ-21'
            '\n 1) Українська мова'
            '\n 2) Іноземна мова'
            '\n 3) Історія України'
            '\n 4) Інформатика (мс)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-21"
            '\n 1) Хімія / -'
            '\n 2) Фізика і астрономія'
            '\n 3) - /ФК (ф)'
            )
}
zi_22 = {
    'mon': ('Понеділок\t               ЗІ-22'
            '\n 1) -'
            '\n 2) Георгафія(418)'
            '\n 3) Фізика (418)'
            '\n 4) Математика (418) '
            '\n 5) Фізика і астрономія (418)'
            ),
    'tue': ('Вівторок\t                  ЗІ-22'
            '\n 1)- / Основи правознавства (418)'
            '\n 2) Українська мова (418)'
            '\n 3) Хімія (418)'
            '\n 4) Іноземна мова (418)'
            ),
    'wed':('Середа\t                      ЗІ-22'
            '\n 1) Захист Вітчизни (418)'
            '\n 2) Інформатика (мс) (418)'
            '\n 3) - / ФК (ф) (КФВ)'
            ),
    'thu': ('Четвер\t                      ЗІ-22'
            '\n 1) Фізика і астрономія (418)'
            '\n 2) Українська література (418)'
            '\n 3) Інформатика (шк) (418))'
            '\n 4) Історія України (418)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-22"
            '\n 1) Захист Вітчизни / Хімія (418)'
            '\n 2) Математика (418)'
            '\n 3) Фізична культура (КФВ)'
            '\n 4) Фізина і астрономія (418)'
            )
}
zi_23 = {
    'mon': ('Понеділок\t               ЗІ-23'
            '\n 1)Хімія'
            '\n 2)Українська мова'
            '\n 3)Іноземна мова'
            '\n 4)Фізика'
            ),
    'tue': ('Вівторок\t                  ЗІ-23'
            '\n 1)Фізична культура'
            '\n 2)Інформатика(шкільна)'
            '\n 3)Фізика і астрономія'
            '\n 4)Математика'
            ),
    'wed':('Середа\t                      ЗІ-23'
            '\n 1)-'
            '\n 2)Історія україни'
            '\n 3)Захист Вітчизни  '
            '\n 4)Українська література'
            '\n 5)Фізика і астрономія'
            ),
    'thu': ('Четвер\t                      ЗІ-23'
            '\n 1)Географія'
            '\n 2)Інформатика(мс)'
            '\n 3)Фізика і астрономія'
            '\n 4)Математика'
            ),
    'fri': ("П'ятниця\t                  ЗІ-23"
            '\n 1)Основи правознавства/Фізична культура'
            '\n 2)Захист Вітчизни/Хімія'
            )
}

zi_31 = {
    'mon': ('Понеділок\t               ЗІ-31'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'tue': ('Вівторок\t                  ЗІ-31'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'wed': ('Середа\t                      ЗІ-31'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'thu': ('Четвер\t                      ЗІ-31'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'fri': ("П'ятниця\t                  ЗІ-31"
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            )
}
zi_32 = {
    'mon': ('Понеділок\t               ЗІ-32'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'tue': ('Вівторок\t                  ЗІ-32'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'wed': ('Середа\t                      ЗІ-32'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'thu': ('Четвер\t                      ЗІ-32'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'fri': ("П'ятниця\t                  ЗІ-32"
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            )
}

zi_41 = {
    'mon': ('Понеділок\t               ЗІ-41'
            '\n 1) '
            '\n 2) '
            '\n 3) Програмування в Internet (312л)'
            "\n 4) Мережні ОС (312л)"
            "\n 5) ПАЗ ЛКМ (312л)"
            ),
    'tue': ('Вівторок\t                  ЗІ-41'
            '\n 1) '
            '\n 2) '
            '\n 3) Програмування в Internet (312л)'
            "\n 4) Мультиплексорні технології  (312л)"
            "\n 5) АЗІ та їх експлуатація (312л)"
            ),
    'wed':('Середа\t                      ЗІ-41'
            '\n 1) '
            '\n 2) '
            '\n 3) Глобальні МЗ (312л)'
            "\n 4) Мультиплексорні технології  (312л)"
            "\n 5) ПАЗ ЛКМ (312л)"
            ),
    'thu': ('Четвер\t                      ЗІ-41'
            '\n 1) '
            '\n 2) '
            '\n 3) АЗІ та їх експлуатація (312л)'
            "\n 4) Мережні ОС (312л)"
            "\n 5) Українська мова за ПС (312л)"
            "\n 6) Фізичне виховання (кфв)"
            ),
    'fri': ("П'ятниця\t                  ЗІ-41"
            '\n 1) '
            '\n 2) Глобальні МЗ (312)'
            '\n 3) Українська мова за ПС/ ПАЗ ЛКМ (312)'
            )
}
zi_42 = {
    'mon': ('Понеділок\t               ЗІ-42'
            '\n 1) '
            '\n 2) '
            '\n 3) Програмування в Internet (305л)'
            "\n 4) ПАЗ ЛКМ (305л)"
            "\n 5) Фізичне виховання (кфв)"
            ),
    'tue': ('Вівторок\t                  ЗІ-42'
            '\n 1) '
            '\n 2) '
            '\n 3) Мультиплексорні технології (305л)'
            '\n 4) Мережні ОС (305л)'
            "\n 5) Українська мова за ПС (305л)"
            ),
    'wed':('Середа\t                      ЗІ-42'
            '\n 1) '
            '\n 2) '
            '\n 3) АЗІ та їх експлуатація (305л)'
            "\n 4) ПАЗ ЛКМ (305л)"
            "\n 5) Мультиплексорні технології (305л)"
            ),
    'thu': ('Четвер\t                      ЗІ-42'
            '\n 1) '
            '\n 2) '
            '\n 3) Програмування в Internet (305л)'
            "\n 4) АЗІ та їх експлуатація (305л)"
            "\n 5) Глобальні МЗ (305л)"
            ),
    'fri': ("П'ятниця\t                  ЗІ-42"
            '\n 1) Мережні ОС (305л)'
            '\n 2) ПАЗ ЛКМ / Українська мова за ПС (305л)'
            '\n 3) Глобальні МЗ (305л)'
            )
}



# TO timetables
to_11 = {
    'mon': ('Понеділок\t               ТО-11'
            '\n 1) Основи ЕТ'
            '\n 2) Біологія'
            '\n 3) Інформатика'
            '\n 4) Математика'
            ),
    'tue': ('Вівторок\t                  ТО-11'
            '\n 1) Технології'
            '\n 2) Фізична культура'
            '\n 3) Математика'
            '\n 4) Всесвітня історія'
            ),
    'wed':('Середа\t                      ТО-11'
            '\n 1) Українська мова'
            '\n 2) Зарубіжна література'
            '\n 3) Фізика і астрономія'
            ),
    'thu': ('Четвер\t                      ТО-11'
            '\n 1) Технології'
            '\n 2) Культурологія'
            '\n 3) Іноземна мова'
            '\n 4) - / Фізика і астрономія'
            ),
    'fri': ("П'ятниця\t                  ТО-11"
            '\n 1) Фізична культура/-'
            '\n 2) Українська література'
            '\n 3) Технології'
            )
}
to_12 = {
    'mon': ('Понеділок\t               ТО-12'
            '\n 1) -'
            '\n 2) Основи ЕТ'
            '\n 3) Всесвітня історія'
            '\n 4) Інформатика'
            ),
    'tue': ('Вівторок\t                  ТО-12'
            '\n 1) Біологія'
            '\n 2) Фізика і астрономія'
            '\n 3) Фізична культура'
            '\n 4) Технології'
            ),
    'wed':('Середа\t                      ТО-12'
            '\n 1) Зарубіжна література'
            '\n 2) Українська мова'
            '\n 3) Технології'
            '\n 4) Матем'
            ),
    'thu': ('Четвер\t                      ТО-12'
            '\n 1) Культурологія'
            '\n 2) Іноземна мова'
            '\n 3) Матем'
            ),
    'fri': ("П'ятниця\t                  ТО-12"
            '\n 1) Українська література'
            '\n 2) Технології'
            '\n 3) Фізична культура/Фізика і астрономія'
            )
}

to_21 = {
    'mon': ('Понеділок\t               ТО-21'
            '\n  1) Українська література'
            '\n  2) Іноземна мова'
            '\n  3) Математика'
            '\n  4) Фізика'
            ),
    'tue': ('Вівторок\t                  ТО-21'
            '\n  1) Фізика і астрономія'
            '\n  2) Основи правознавства / Захист Вітчизни'
            '\n  3) Українська мова'
            '\n  4) Інформатика (шк)'
            ),
    'wed':('Середа\t                      ТО-21'
            '\n  1) Фізика і астрономія'
            '\n  2) Фізична культура'
            '\n  3) Інформатика (мс)'
            '\n  4) Захист Вітчизни'
            ),
    'thu': ('Четвер\t                      ТО-21'
            '\n  1)Фізика і астрономія'
            '\n  2) Хімія'
            '\n  3) Географія'
            ),
    'fri': ("П'ятниця\t                  ТО-21"
            '\n 1) Математика '
            '\n 2) Хімія / ФК (ф)'
            '\n 3) Історія України'
            )
}
to_22 = {
    'mon': ('Понеділок\t               ТО-22'
            '\n  1) Іноземна мова'
            '\n  2) Математика'
            '\n  3) Фізика'
            '\n  4) Українська література'
            ),
    'tue': ('Вівторок\t                  ТО-22'
            '\n  1) Основи правознавства / Захист Вітчизни'
            '\n  2)Українська мова'
            '\n  3) Інформатика (шк)'
            '\n  4) Хімія'
            ),
    'wed':('Середа\t                      ТО-22'
            '\n  1) -'
            '\n  2) Георгафія'
            '\n  3) Фізична культура'
            '\n  4) Фізика і астрономія'
            ),
    'thu': ('Четвер\t                      ТО-22'
            '\n  1) Інформатика (мс)'
            '\n  2) Історія України'
            '\n  3) Фізика і астрономія'
            '\n  4) Захист Вітчизни'
            ),
    'fri': ("П'ятниця\t                  ТО-22"
            '\n 1) Фізика і астрономія'
            '\n 2) ФК (ф) / Хімія'
            '\n 3) Математика'
            )
}

to_31 = {
    'mon': ('Понеділок\t               ТО-31'
            '\n 1) -'
            '\n 2) Фізичне виховання(кфв)'
            '\n 3) Основи ООП(408)'
            ),
    'tue': ('Вівторок\t                  ТО-31'
            '\n 1) Фізичне виховання(кфв)'
            '\n 2) Системна програмування(415)'
            '\n 3) Основи ТМ та С(211л)'
            '\n 4) Цифрові СК та їх ТО(211л)'
            ),
    'wed':('Середа\t                      ТО-31'
            '\n 1) Засоби ОТ та їх ТО(306л)'
            '\n 2) Системна програмування(415)'
            '\n 3) Основи ТМ та С(211л)'
            '\n 4) Цифрові СК та їх ТО(211л)'
            ),
    'thu': ('Четвер\t                      ТО-31'
            '\n 1) Іноземна мова(302)'
            '\n 2) Основи ООП(408)'
            '\n 3) ЗОТ та їх ТО(204л) / ОТМ(211л)'
            '\n 4) Цифрові СК та їх ТО(211л)'
            ),
    'fri': ("П'ятниця\t                  ТО-31"
            '\n 1) Основи ООП(408)'
            '\n 2) Засоби ОТ та їх ТО(306л)'
            '\n 3) Іноземна мова(302)'
            )
}
to_32 = {
    'mon': ('Понеділок\t               ТО-32'
            '\n 1) Основи ООП(408)'
            '\n 2) Цифрові СК та їх ТО(306л)'
            '\n 3) Цифрові ТМ та С(306л)'
            '\n 4) Фізична культура(кфв)'
            ),
    'tue': ('Вівторок\t                  ТО-32'
            '\n 1) Системне програмування(415)'
            '\n 2) Фізичне виховання(кфв)'
            '\n 3) Цифрові СК та їх ТО(306л)'
            '\n 4) Осноми ТМ та С(306л)'
            ),
    'wed':('Середа\t                      ТО-32'
            '\n 1) -'
            '\n 2) Засоби ОТ та їх ТО(306л)'
            '\n 3) Системне програмування(415)'
            '\n 4) Іноземна мова(1)(215)'
            ),
    'thu': ('Четвер\t                      ТО-32'
            '\n 1) Іноземна мова(2)(215)'
            '\n 2) ЗОТ та їх ТО(204л) / ОТМ(211л)'
            '\n 3) Цифрові СК та їх ТО(306л)'
            '\n 4) Основи ООП(408)'
            ),
    'fri': ("П'ятниця\t                  ТО-32"
            '\n 1) -'
            '\n 2) Основи ООП(408)'
            '\n 3) Засоби ОТ та їх ТО(306л)'
            )
}

to_41 = {
    'mon': ('Понеділок\t               ТО-41'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'tue': ('Вівторок\t                  ТО-41'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'wed':('Середа\t                      ТО-41'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'thu': ('Четвер\t                      ТО-41'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'fri': ("П'ятниця\t                  ТО-41"
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            )
}
to_42 = {
    'mon': ('Понеділок\t               ТО-42'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'tue': ('Вівторок\t                  ТО-42'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'wed':('Середа\t                      ТО-42'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'thu': ('Четвер\t                      ТО-42'
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            ),
    'fri': ("П'ятниця\t                  ТО-42"
            '\n 1) '
            '\n 2) '
            '\n 3) '
            "\n 4) "
            )
}
