import db

def check(user: int, day: str):
    try:
        return eval("%s" % db.check_group(user) + "['%s']" % day)
    except:
        return ('От халепа! Виникла помилка. Спробуй написати /start . Якщо не це не допомогло, напиши моєму творцю: @P0wer_bla4er')


discipline = [
        
]


month = """
Парні(Низ)⠀ ⠀Непарні(Верх)
13.01 - 19.01⠀⠀⠀20.01 - 26.01
27.01 - 02.02⠀⠀⠀23.02 - 09.02
10.02 - 16.02⠀⠀⠀17.02 - 23.02
24.02 - 01.03⠀⠀⠀02.03 - 08.03
09.03 - 15.03⠀⠀⠀16.03 - 22.03
23.03 - 29.03⠀⠀⠀30.03 - 05.04
06.04 - 12.04⠀⠀⠀13.04 - 19.04
20.04 - 26.04⠀⠀⠀27.04 - 03.05
04.05 - 10.05⠀⠀⠀11.05 - 17.05
18.05 - 24.05⠀⠀⠀25.05 - 31.05
01.06 - 07.06⠀⠀⠀08.06 - 14.06
15.06 - 21.06⠀⠀⠀22.06 - 28.06

Актуально до  28.06.2020
"""


lesson_time = '''
<b>Пара  Початок - кінець</b>
    1               08:30 - 10:05
    2               10:15 - 11:50
    3               12:20 - 13:55
    4               14:05 - 15:40
    5               15:50 - 17:25
'''

break_time = '''
<b>П'ятихвилинні перерви: </b>
             09:15 - 09:20
             11:00 - 11:05
             13:05 - 13:10
             14:50 - 14:55
             16:35 - 16:40
'''


# OK timetables
ok_11 = {
    'mon': ('Понеділок\t               ОК-11'
            '\n 1) -'
            '\n 2) -'
            '\n 3) Іноземна мова(302)'
            '\n 4) Фізика і астрономія(413)'
            ),
    'tue': ('Вівторок\t                  ОК-11'
            '\n 1) Українська мова(215)'
            '\n 2) Фізика і астрономія(413)'
            '\n 3) Біологія і екологія(404)'
            '\n 4) Зарубіжна література(214)'
            ),
    'wed':('Середа\t                      ОК-11'
            '\n 1) Хімія(302) / ФК(кфв)'
            '\n 2) Інформатика(406)'
            '\n 3) Соціологія(226)'
            '\n 4) Історія України(211)'
            ),
    'thu': ('Четвер\t                      ОК-11'
            '\n 1) Інформатика(406)'
            '\n 2) Біологія і екологія(413)'
            '\n 3) Математика(406)'
            '\n 4) Українська література(215)'
            ),
    'fri': ("П'ятниця\t                  ОК-11"
            '\n 1) Фізична культура(кфв)'
            '\n 2) Всес. істор.(213) / Осн. пр-ва(213)'
            '\n 3) Математика(406)'
            )
}   # ++
ok_12 = {
    'mon': ('Понеділок\t               ОК-12'
            '\n 1) Фізика і астрономія(413)'
            '\n 2) Українська література(215)'
            '\n 3) Соціологія(226)'
            '\n 4) Іноземна мова(302)'
            ),
    'tue': ('Вівторок\t                  ОК-12'
            '\n 1) Фізика і астрономія(413)'
            '\n 2) Українська мова(215)'
            '\n 3) Зарубіжна література(214)'
            '\n 4) Біологія і екологія(404)'
            ),
    'wed': ('Середа\t                      ОК-12'
            '\n 1) -'
            '\n 2) ФК(кфв) / Хімія(302)'
            '\n 3) Історія України(211)'
            '\n 4) Інформатика(406)'
            ),
    'thu': ('Четвер\t                      ОК-12'
            '\n 1) Біологія і екологія(413)'
            '\n 2) Математика(406)'
            '\n 3) Фізична культура(кфв)'
            '\n 4) Інформатика(406)'
            ),
    'fri': ("П'ятниця\t                  ОК-12"
            '\n 1) -'
            '\n 2) Математика(406)'
            '\n 3) Всес. істор.(213) / Осн. пр-ва(213)'
            )
}   # ++

ok_21 = {
    'mon': ('Понеділок\t               ОК-21'
            '\n 1) Хімія(401) / -'
            '\n 2) Основи схемотехніки(312л)'
            '\n 3) Історія України(211) / Географія(301)'
            '\n 4) Українська література(215)'
            ),
    'tue': ('Вівторок\t                  ОК-21'
            '\n 1) Основи економічної теорії(301)'   
            '\n 2) Основи схемотехніки(312л)'
            '\n 3) Математика(406)'
            '\n 4) Захист Вітчизни(301)'
            ),
    'wed': ('Середа\t                      ОК-21' 
            '\n 1) Теорія Е та МК(404)'
            '\n 2) Українська мова(215)'
            '\n 3) Математика(406)'
            '\n 4) Основи схемотехніки(312л)'
            ),
    'thu': ('Четвер\t                      ОК-21' 
            '\n 1) ФК(кфв) / ЗВ(301)'
            '\n 2) Географія(301)'
            '\n 3) Хімія(401)'
            '\n 4) Історія України(211)'
            ),

    'fri': ("П'ятниця\t                  ОК-21"
            '\n 1) Іноземна мова'
            "\n 2) Комп'ютерна логіка"
            '\n 3) Фізична культура'
            )
}   # ++
ok_22 = {
    'mon': ('Понеділок\t               ОК-22'
            '\n 1) Основи схемотехніки(312л)'
            '\n 2) Хімія(401)'
            '\n 3) Українська література(215)'
            '\n 4) Історія України(211) / -'
            ),
    'tue': ('Вівторок\t                  ОК-22'
            '\n 1) Фізична культура(кфв)'
            '\n 2) Основи економічної теорії(301)'
            '\n 3) Основи схемотехніки(312л)'
            '\n 4) Математика(406)'
            ),
    'wed': ('Середа\t                      ОК-22'
            '\n 1) Математика(406)'
            '\n 2) Теорія Е та МК(404)'
            '\n 3) Українська мова(315)'
            '\n 4) Географія(301)'
            ),
    'thu': ('Четвер\t                      ОК-22'
            '\n 1) Захист Вітчизни(301) / Хімія(401)'
            '\n 2) Основи схемотехніки(312л)'
            '\n 3) Історія України(211)'
            '\n 4)  ФК(кфв) / Географія(301)'
            ),
    'fri': ("П'ятниця\t                  ОК-22"
            '\n 1) Захист Вітчизни(301)'
            '\n 2) Іноземна мова(302)'
            "\n 3) Комп'ютерна логіка(230)"
            )
}   # ++


ok_31 = {
    'mon': ('Понеділок\t               ОК-31'
            '\n 1) -'
            '\n 2) Іноземна мова(1)(302)'
            '\n 3) Організація баз даних(414)'
            "\n 4) Комп'ютерна схемотехніка(416)"
            '\n 5) Іноземна мова(2)(302)'
            ),
    'tue': ('Вівторок\t                  ОК-31'
            '\n 1) Організація баз даних(414)'
            '\n 2) Програмування(405)'
            "\n 3) Архітекрута комп'ютерів(414)"
            '\n 4) Операційні системи(314)'
            ),
    'wed':('Середа\t                      ОК-31'
            '\n 1) -'
            '\n 2) Фізичне виховання(кфв)'
            '\n 3) Програмування(405)'
            '\n 4) Периферійні пристрої(306л)'
            ),
    'thu': ('Четвер\t                      ОК-31'
            '\n 1) -'
            '\n 2) Операційні системи(314)'
            '\n 3) Фізичне виховання(кфв)'
            "\n 4) ОБД(414)"
            ),
    'fri': ('П\'ятниця\t                  ОК-31'
            '\n 1) Арх. комп.(414) / ОБД(414)'
            '\n 2) Інженерна та КГ(416)'
            "\n 3) Комп'ютерна схемотехніка(404)"
            )
}   # ++
ok_32 = {
    'mon': ('Понеділок\t               ОК-32'
            '\n 1) Іноземна мова(1)(302)'
            '\n 2) Арх. комп.(414) / ОБД(414)'
            "\n 3) Комп'ютерна схемотехніка(416)"
            ),
    'tue': ('Вівторок\t                  ОК-32'
            '\n 1) -'
            '\n 2) Організація баз даних(414)'
            '\n 3) Програмування(405)'
            "\n 4) Архітектура комп'ютерів(414)"
            ),
    'wed':('Середа\t                      ОК-32'
            "\n 1) Комп'ютерна схемотехніка(416)"
            "\n 1) Операційні системи(314)"
            "\n 2) Фізичне виховання(кфв)"
            '\n 3) Програмування(408)'
            ),
    'thu': ('Четвер\t                      ОК-32'
            '\n 1) -'
            '\n 2) Фізичне виховання(кфв)'
            "\n 3) Архітектура комп'ютерів(414)"
            '\n 4) Операційні системи(314)'
            '\n 5) Іноземна мова(2)(302)'
            ),
    'fri': ("П'ятниця\t                  ОК-32"
            '\n 1) Периферійні пристрої(306л)'
            '\n 2) Організація баз даних(414)'
            '\n 3) Інженерна та КГ(416)'
            )
}   # ++

ok_41 = {
    'mon': ('Понеділок\t               ОК-41'
            '\n 1) Економіка та ПВ(418)'
            '\n 2) Програмування в Internet(410)'
            '\n 3) Соціологія(213)'
            '\n 4) Н, Д та Е КС та М(230)'
            ),
    'tue': ('Вівторок\t                  ОК-41'
            '\n 1) -'
            '\n 2) -'
            '\n 3) Н, Д та Е КС та М(405)'
            '\n 4) Програмування в Internet(410)'
            ),
    'wed':('Середа\t                      ОК-41'
            '\n 1) -'
            '\n 2) Програмування в Internet(410)'
            '\n 3) Економіка та ПВ(418)'
            '\n 4) Електрорадіовимірювання(304л)'
            '\n 5) Соціологія(213) / -'
            ),
    'thu': ('Четвер\t                      ОК-41'
            '\n 1) -'
            '\n 2) Електрорадіовимірювання(304л)'
            '\n 3) Н, Д та Е КС та М(416)'
            '\n 4) Економіка та ПВ(418)'
            ),
    'fri': ("П'ятниця\t                  ОК-41"
            '\n 1) Електрорадіовимірювання(304л)'
            '\n 2) Програмування в Internet(410)'
            '\n 3) Електрорадіовимір. (304л) / -'
            )
}   # ++
ok_42 = {
    'mon': ('Понеділок\t               ОК-42'
            '\n 1) Соціологія(213)'
            '\n 2) Економіка та ПВ(418)'
            '\n 3) Програмування в Internet(410)'
            '\n 4) Електрорадіовимірювання(304л)'
            ),
    'tue': ('Вівторок\t                  ОК-42'
            '\n 1) -'
            '\n 2) -'
            '\n 3) Програмування в Internet(410)'
            '\n 4) Н, Д та Е КС та М(405)'
            ),
    'wed':('Середа\t                      ОК-42'
            '\n 1) -'
            '\n 2) Н, Д та Е КС та М(230)'
            '\n 3) Програмування в Internet(410)'
            '\n 4) Економіка та ПВ(418)'
            '\n 5) Електрорадіовимірювання(304л) / -'
            ),
    'thu': ('Четвер\t                      ОК-42'
            '\n 1) - / Соціологія(213)'
            '\n 2) Н, Д та Е КС та М(416)'
            '\n 3) Економіка та ПВ(418)'
            ),
    'fri': ("П'ятниця\t                  ОК-42"
            '\n 1) Програмування в Internet(410)'
            '\n 2) Електрорадіовимірювання(304л)'
            )
}   # ++



# ZI timetables
zi_11 = {
    'mon': ('Понеділок\t               ЗІ-11'
            '\n 1) -'
            '\n 2) Математика(407)'
            '\n 3) Біологія і екологія(401)'
            '\n 4) Фізика і астрономія(404)'
            ),
    'tue': ('Вівторок\t                  ЗІ-11'
            '\n 1) Біологія і екологія(401)'
            '\n 2) Зарубіжна література(214)'
            '\n 3) Історія України(211)'
            '\n 4) Іноземна мова(302)'
            ),
    'wed':('Середа\t                      ЗІ-11'
            '\n 1) - / Хімія(302)'
            '\n 2) - / ФК(кфв)'
            '\n 3) Всес. істор.(213) / Осн. пр-ва(213)'
            '\n 4) Українська мова(225)'
            ),
    'thu': ('Четвер\t                      ЗІ-11'
            '\n 1) Українська література(225)'
            '\n 2) Математика(407)'
            '\n 3) Фізика і астрономія(404)'
            '\n 4) Інформатика(405)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-11"
            '\n 1) Соціологія(211)'
            '\n 2) Фізична культура(кфв)'
            '\n 3) Інформатика(405)'
            )
}   # ++
zi_12 = {
    'mon': ('Понеділок\t               ЗІ-12'
            '\n 1) Математика(407)'
            '\n 2) Фізика і астрономія(413)'
            '\n 3) Інформатика(405)'
            '\n 4) Біологія і екологія(401)'
            ),
    'tue': ('Вівторок\t                  ЗІ-12'
            '\n 1) Зарубіжна література(214)'
            '\n 2) Біологія і екологія(401)'
            '\n 3) Фізика і астрономія(413)'
            '\n 4) Історія України(211)'
            ),
    'wed':('Середа\t                      ЗІ-12'
            '\n 1) - '
            '\n 2) Хімія(302) / ФК(кфв)'
            '\n 3) Українська мова(230)'
            '\n 4) Всес. істор.(213) / Осн. пр-ва(213)'
            ),
    'thu': ('Четвер\t                      ЗІ-12'
            '\n 1) Математика(407)'
            '\n 2) Інформатика(405)'
            '\n 3) Українська мова(230)'
            '\n 4) Іноземна мова(302)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-12"
            '\n 1) -'
            '\n 2) Фізична кульура(кфв)'
            '\n 3) Соціологія(211)'
            )
}   # ++
zi_13 = {
    'mon': ('Понеділок\t               ЗІ-13'
            '\n 1) ФК(кфв)'
            '\n 2) Математика(406)'
            '\n 3) Фізика і астрономія(413)'
            '\n 4) Соціологія(226)'
            ),
    'tue': ('Вівторок\t                  ЗІ-13'
            '\n 1) -'
            '\n 2) Іноземна мова(302)'
            '\n 3) Біологія і екологія(401)'
            '\n 4) Фізика і астрономія(413)'
            ),
    'wed':('Середа\t                      ЗІ-13'
            '\n 1) Інформатика(405)'
            '\n 2) Історія України(211)'
            '\n 3) Математика(407)'
            '\n 4) Українська мова(230)'
            ),
    'thu': ('Четвер\t                      ЗІ-13'
            '\n 1) Фізична культура(кфв)'
            '\n 2) Українська література(230)'
            '\n 3) Інформатика(405)'
            '\n 4) Біологія і екологія(401)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-13"
            '\n 1) Всес. істор.(213) / Осн. пр-ва(213)'
            '\n 2) Зарубіжна література(214)'
            '\n 3) Хімія(401)'
            )
}   # ++

zi_21 = {
    'mon': ('Понеділок\t               ЗІ-21'
            '\n 1) -'
            '\n 2) ФК(кфв) / -'
            '\n 3) Географія(301) / Іст. України(211)'
            '\n 4) Основи схемотехніки(312л)'
            '\n 5) Основи ЕТ(301)'
            ),
    'tue': ('Вівторок\t                  ЗІ-21'
            '\n 1) Основи схемотехніки(312л)'
            '\n 2) Теорія ЕК та сигналів(309л)'
            '\n 3) Математика(407)'
            '\n 4) Українська література(230)'
            ),
    'wed':('Середа\t                      ЗІ-21'
            '\n 1) Основи схемотехніки(312л)'
            '\n 2) Географія(301)'
            '\n 3) Захист Вітчизни(301л)'
            '\n 4) Хімія(302)'
            ),
    'thu': ('Четвер\t                      ЗІ-21'
            '\n 1) Інформатика(405)'
            '\n 2) Історія України(211)'
            '\n 3) Іноземна мова(226)'
            '\n 4) Українська мова(230)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-21"
            '\n 1) ЗВ(301л) / Хімія(401)'
            '\n 2) Математика(407)'
            '\n 3) Фізична культура(кфв)'
            )
}   # ++
zi_22 = {
    'mon': ('Понеділок\t               ЗІ-22'
            '\n 1) Географія(301) / Хімія(401)'
            '\n 2) ЗВ(301) / Історія України(211)'
            '\n 3) Фізична культура(кфв)'
            '\n 4) Основи ЕТ(301)'
            ),
    'tue': ('Вівторок\t                  ЗІ-22'
            '\n 1) Теорія ЕК та сигналів(309л)'
            '\n 2) Математика(407)'
            '\n 3) Географія(301)'
            '\n 4) Основи схемотехніники(312л)'
            ),
    'wed':('Середа\t                      ЗІ-22'
            '\n 1) Українська мова(215)'
            '\n 2) Інформатика(405)'
            '\n 3) Основи схемотехніники(312л)'
            '\n 4) - / ФК(кфв)'
            ),
    'thu': ('Четвер\t                      ЗІ-22'
            '\n 1) Історія України(211)'
            '\n 2) Хімія(401)'
            '\n 3) Основи схемотехніника(312л)'
            '\n 4) Іноземна мова(226)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-22"
            '\n 1) Українська література(215)'
            '\n 2) Захист відчизни(301)'
            '\n 3) Математика(407)'
            )
}   # ++

zi_31 = {
    'mon': ('Понеділок\t               ЗІ-31'
            '\n 1) - '
            '\n 2) Основи ООП(408)'
            '\n 3) Фізичне виховання(кфв)'
            '\n 4) ПАЗ ЛКМ(204л)'
            ),
    'tue': ('Вівторок\t                  ЗІ-31'
            '\n 1) Основи охорони праці(204л)'
            '\n 2) Інформаційні ресурси Internet(201л)'
            '\n 3) Іноземна мова(1)(302)'
            '\n 4) Системне програмування(415)'
            ),
    'wed': ('Середа\t                      ЗІ-31'
            '\n 1) Системи телекомунікацій(419)'
            '\n 2) Інформаційні ресурси Internet(201л)'
            '\n 3) АЗІ та їх експлуатація(305л)'
            '\n 4) Системне програмування(415) / -'
            ),
    'thu': ('Четвер\t                      ЗІ-31'
            '\n 1) -'
            '\n 2) Іноземна мова(2)(302)'
            '\n 3) Основи ООП(408)'
            '\n 4) АЗІ та їх експлуатація(305л)'
            '\n 5) ПАЗ ЛКМ(204л)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-31"
            '\n 1) Системи телекомунікацій(419)'
            '\n 2) Фізичне виховання(кфв)'
            '\n 3) Основи ООП(408) / -'

            )
}   # ++
zi_32 = {
    'mon': ('Понеділок\t               ЗІ-32'
            '\n 1) -'
            '\n 2) АЗІ та їх експлуатація(305л)'
            '\n 3) ПАЗ ЛКМ(204л)'
            '\n 4) Основи ООП(408)'
            ),
    'tue': ('Вівторок\t                  ЗІ-32'
            '\n 1) Іноземна мова(1)(302)'
            '\n 2) Основи охорони праці(204л)'
            '\n 3) Системне програмування(415)'
            '\n 4) Інформаційні ресурси Internet(201л)'
            ),
    'wed': ('Середа\t                      ЗІ-32'
            '\n 1) Фізичне виховання(кфв)'
            '\n 2) Основи ООП(408)'
            '\n 3) Інформаційні ресурси Internet(201л)'
            '\n 4) - / Системне програмування(415)'
            ),
    'thu': ('Четвер\t                      ЗІ-32'
            '\n 1) Системи телекомунікацій(419)'
            '\n 2) АЗІ та їх експлуатація(305л)'
            '\n 3) Іноземна мова(2)(302)'
            '\n 4) ПАЗ ЛКМ(204л)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-32"
            '\n 1) Фізичне виховання(кфв)'
            '\n 2) Системи телекомунікацій(419)'
            '\n 3) - / Основи ООП(408)'
            )
}   # ++

zi_41 = {
    'mon': ('Понеділок\t               ЗІ-41'
            '\n 1) -'
            '\n 2) Основи ФЗ(213) / -'
            '\n 3) Мережні операційні системи(314)'
            '\n 4) Економіка галузі(418)'
            ),
    'tue': ('Вівторок\t                  ЗІ-41'
            '\n 1) - / АЗІ та їх Е(305л)'
            '\n 2) Мережні операційні системи(314)'
            '\n 3) Основи ФЗ(213)'
            '\n 4) Економіка галузі(418)'
            ),
    'wed':('Середа\t                      ЗІ-41'
            '\n 1) Економіка галузі(418)'
            '\n 2) Мережні операційні системи(314)'
            '\n 3) Глобальні МЗ(205л)'
            '\n 4) АЗІ та їх експлуатація(305л)'
            ),
    'thu': ('Четвер\t                      ЗІ-41'
            '\n 1) -'
            '\n 2) Соціологія(213)'
            '\n 3) Програмування в Internet(314)'
            '\n 4) Глобальні МЗ(205л)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-41"
            '\n 1) АЗІ та їх експлуатація(305л)'
            '\n 2) Програмування в Internet(314)'
            )
}   # ++
zi_42 = {
    'mon': ('Понеділок\t               ЗІ-42'
            '\n 1)'
            '\n 2) - / Основи ФЗ(213)'
            '\n 3) Економіка галузі(418)'
            '\n 4) Соціологія(213)'
            ),
    'tue': ('Вівторок\t                  ЗІ-42'
            '\n 1) Економіка галузі(418)'
            '\n 2) Основи ФЗ(213)'
            '\n 3) Мережні операційні системи(314)'
            '\n 4) АЗІ та їх експлуатація(305л)'
            ),
    'wed':('Середа\t                      ЗІ-42'
            '\n 1) АЗІ та їх експлуатація(205л) / -'
            '\n 2) Економіка галузі(418)'
            '\n 3) Мережні операційні системи(314)'
            '\n 4) Глобальні МЗ(205л)'
            ),
    'thu': ('Четвер\t                      ЗІ-42'
            '\n 1) -'
            '\n 2) Мережні операційні системи(314)'
            '\n 3) АЗІ та їх експлуатація(205л)'
            '\n 4) Програмування в Internet(314)'
            ),
    'fri': ("П'ятниця\t                  ЗІ-42"
            '\n 1) Програмування в Internet(314)'
            '\n 2) Глобальні МЗ(305л)'
            )
}   # ++



# TO timetables
to_11 = {
    'mon': ('Понеділок\t               ТО-11'
            '\n 1) -'
            '\n 2) Інформатика(405)'
            '\n 3) Фізика і астрономія(404)'
            '\n 4) Математика(407)'
            ),
    'tue': ('Вівторок\t                  ТО-11'
            '\n 1) Біологія і екологія(404)'
            '\n 2) Історія України(211)'
            '\n 3) Іноземна мова(226)'
            '\n 4) Українська мова(215)'
            ),
    'wed':('Середа\t                      ТО-11'
            '\n 1) Всес. істор.(213) / Осн. пр-ва(213)'
            '\n 2) Біологія і екологія(413)'
            '\n 3) Хімія(302) / ФК(кфв)'
            ),
    'thu': ('Четвер\t                      ТО-11'
            '\n 1) Фізика і астрономія(404)'
            '\n 2) Українська література(215)'
            '\n 3) Математика(407)'
            '\n 4) Фізична культура(кфв)'
            ),
    'fri': ("П'ятниця\t                  ТО-11"
            '\n 1) Інформатика(405)'
            '\n 2) Соціологія(211)'
            '\n 3) Зарубіжна література(214)'
            )
}   # ++
to_12 = {
    'mon': ('Понеділок\t               ТО-12'
            '\n 1) -'
            '\n 2) Фізика і астрономія(404)'
            '\n 3) Математика(407)'
            '\n 4) Інформатика(405)'
            ),
    'tue': ('Вівторок\t                  ТО-12'
            '\n 1) Історія України(211)'
            '\n 2) Біологія і екологія(404)'
            '\n 3) Україська мова(215)'
            '\n 4) Іноземна мова(226)'
            ),
    'wed':('Середа\t                      ТО-12'
            '\n 1) Біологія і екологія(413)'
            '\n 2) Всес. істор.(213) / Осн. пр-ва(213)'
            '\n 3) ФК(кфв) / Хімія(320)'
            '\n 4) Соціологія(226)'
            ),
    'thu': ('Четвер\t                      ТО-12'
            '\n 1) -'
            '\n 2) Фізика і астрономія(404)'
            '\n 3) Українська література(215)'
            '\n 4) Математика(407)'
            '\n 4) Фізична культура(кфв)'
            ),
    'fri': ("П'ятниця\t                  ТО-12"
            '\n 1) Зарубіжна література(214)'
            '\n 2) Інформатика(405)'
            )
}   # ++

to_21 = {
    'mon': ('Понеділок\t               ТО-21'
            '\n 1) Інформатика(405)'
            '\n 2) Історія України(211) / Географія(301)'
            '\n 3) Основи схемотехніки(312л)'
            '\n 4) Захист Вітчизни(301л)'
            ),
    'tue': ('Вівторок\t                  ТО-21'
            '\n 1) Математика(407)'
            '\n 2) Іноземна мова(226)'
            '\n 3) Теорія ЕК та сигналів(309л)'
            '\n 4) Хімія(401)'
            ),
    'wed':('Середа\t                      ТО-21'
            '\n 1) Історія України(211)'
            '\n 2) Основи схемотехніки(312л)'
            '\n 3) Географія(301)'
            '\n 4) Фізична культура(кфв)'
            ),
    'thu': ('Четвер\t                      ТО-21'
            '\n 1) Хімія(401)/Фізична культура(кфв)'
            '\n 2) Українська мова(225)'
            '\n 3) Основи ЕТ(301)'
            '\n 4) Основи схемотехніки(312л)'
            ),
    'fri': ("П'ятниця\t                  ТО-21"
            '\n 1) Математика(407)'
            '\n 2) Українська літерату(215)'
            '\n 3) - / Захист Вітчизни(301)'
            )
}   # ++

to_31 = {
    'mon': ('Понеділок\t               ТО-31'
            '\n 1) -'
            '\n 2) Фізичне виховання(кфв)'
            '\n 3) Основи ООП(408)'
            ),
    'tue': ('Вівторок\t                  ТО-31'
            '\n 1) Фізичне виховання(кфв)'
            '\n 2) Системна програмування(415)'
            '\n 3) Основи ТМ та С(211л)'
            '\n 4) Цифрові СК та їх ТО(211л)'
            ),
    'wed':('Середа\t                      ТО-31'
            '\n 1) Засоби ОТ та їх ТО(306л)'
            '\n 2) Системна програмування(415)'
            '\n 3) Основи ТМ та С(211л)'
            '\n 4) Цифрові СК та їх ТО(211л)'
            ),
    'thu': ('Четвер\t                      ТО-31'
            '\n 1) Іноземна мова(302)'
            '\n 2) Основи ООП(408)'
            '\n 3) ЗОТ та їх ТО(204л) / ОТМ(211л)'
            '\n 4) Цифрові СК та їх ТО(211л)'
            ),
    'fri': ("П'ятниця\t                  ТО-31"
            '\n 1) Основи ООП(408)'
            '\n 2) Засоби ОТ та їх ТО(306л)'
            '\n 3) Іноземна мова(302)'
            )
}   # ++
to_32 = {
    'mon': ('Понеділок\t               ТО-32'
            '\n 1) Основи ООП(408)'
            '\n 2) Цифрові СК та їх ТО(306л)'
            '\n 3) Цифрові ТМ та С(306л)'
            '\n 4) Фізична культура(кфв)'
            ),
    'tue': ('Вівторок\t                  ТО-32'
            '\n 1) Системне програмування(415)'
            '\n 2) Фізичне виховання(кфв)'
            '\n 3) Цифрові СК та їх ТО(306л)'
            '\n 4) Осноми ТМ та С(306л)'
            ),
    'wed':('Середа\t                      ТО-32'
            '\n 1) -'
            '\n 2) Засоби ОТ та їх ТО(306л)'
            '\n 3) Системне програмування(415)'
            '\n 4) Іноземна мова(1)(215)'
            ),
    'thu': ('Четвер\t                      ТО-32'
            '\n 1) Іноземна мова(2)(215)'
            '\n 2) ЗОТ та їх ТО(204л) / ОТМ(211л)'
            '\n 3) Цифрові СК та їх ТО(306л)'
            '\n 4) Основи ООП(408)'
            ),
    'fri': ("П'ятниця\t                  ТО-32"
            '\n 1) -'
            '\n 2) Основи ООП(408)'
            '\n 3) Засоби ОТ та їх ТО(306л)'
            )
}   # ++

to_41 = {
    'mon': ('Понеділок\t               ТО-41'
            '\n 1) -'
            '\n 2) Обладнання ІМП(419)'
            '\n 3) Ремонт КПЕЗ(201л)'
            ),
    'tue': ('Вівторок\t                  ТО-41'
            '\n 1) Основи ФЗ(214)'
            '\n 2) Економіка галузі(418)'
            '\n 3) Мультиплексорні технології(201л)'
            '\n 4) Обладнання ІМП(419)'
            ),
    'wed':('Середа\t                      ТО-41'
            '\n 1) - / ОБД(415)'
            '\n 2) Обладнання ІМП(419)'
            '\n 3) Системи та МЗ з РО(209л)'
            '\n 4) МПТ(201л) / -'
            '\n 5) Соціологія(213) / -'
            ),
    'thu': ('Четвер\t                      ТО-41'
            '\n 1) Ремонт КПЕЗ(201л)'
            '\n 2) Економіка галузі(418)'
            '\n 3) Соціологія(213)'
            '\n 4) Організація баз даних(415)'
            ),
    'fri': ("П'ятниця\t                  ТО-41"
            '\n 1) Мультиплексорні технології(201л)'
            '\n 2) Системи та МЗ з РО(209л)'
            )
}   # ++
to_42 = {
    'mon': ('Понеділок\t               ТО-42'
            '\n 1) -'
            '\n 2) Ремонт КПЕЗ(201л)'
            '\n 3) Обладнання ІМП(419)'
            ),
    'tue': ('Вівторок\t                  ТО-42'
            '\n 1) - / Ремонт КПЕЗ(201л)'
            '\n 2) Обладнання ІМП(419)'
            '\n 3) Економіка галузі(418)'
            '\n 4) Основи ФЗ(213)'
            ),
    'wed':('Середа\t                      ТО-42'
            '\n 1) ОБД(415) / -'
            '\n 2) Системи та МЗ з РО(209л)'
            '\n 3) Обладнання ІМП(419)'
            '\n 4) - / МПТ(201л)'
            '\n 5) - / Соціологія(213)'
            ),
    'thu': ('Четвер\t                      ТО-42'
            '\n 1) Економіка галузі(418)'
            '\n 2) Мультиплексорні технології(201л)'
            '\n 3) Організація баз даних(415)'
            '\n 4) Соціологія(213)'
            ),
    'fri': ("П'ятниця\t                  ТО-42"
            '\n 1) Системи та МЗ з РО(209л)'
            '\n 2) Мультиплексорні технології(201л)'
            )
}   # ++
